
{"section1":"complete","section2":"complete","section3":"complete","section4":"complete","section5":"complete","section6":"complete","location":"Flat River, PE","industries":{"101":"Management"},"current":"","current_id":"4","uid":"1138","language":["1"],"public":null,"first_name":"Marian","last_name":"Burrows","country":"CA","email":"robertb@pei.sympatico.ca","phone":"902 659-2740","cell":"0","industry_list":{"":"","4":"Advanced Technology","11":"Agriculture","16":"Architure and Design","19":"Arts ","24":"Automotive","7":"Aviation & Aerospace ","26":"Construction","29":"Culture","35":"Education","41":"Engineering ","44":"Entertainment  ","50":"Environmental Services","53":"Financial Services","60":"Food & Beverage","64":"Government ","72":"Health ","83":"Human Resources ","85":"Information Technology","93":"Insurance","96":"Legal","101":"Management","106":"Manufacturing ","119":"Marketing and Communication","125":"Media","128":"Military","132":"Multimedia","139":"Natural Resources","143":"Non-Profit","151":"Processing ","154":"Professional Services","160":"Real Estate","164":"Recreation and Sports","169":"Retail","182":"Science","185":"Security\/Safety","188":"Services (General Services)","191":"Telecommunications","80":"Tourism and Hospitality","194":"Transportation & Distribution","200":"Utilities"},"current_name":"Unemployed","job_apply":{"128":"2014-05-29 10:12:06","137":"2014-05-29 10:12:06"},"fullname":"Marian Burrows","primary_industry":{"id":"101","name":"Management"},"provinces":{"0":"-","2":"Alberta","8":"British Columbia","3":"Manitoba","1":"New Brunswick","9":"Newfoundland and Labrador","7":"Nova Scotia","10":"Ontario","4":"Prince Edward Island","5":"Qu&#233;bec","6":"Saskatchewan"},"highlights":"I am a senior level professional with over 12 years of experience as an Executive Assistant and Office Manager, in addition to many years’ experience at a senior level, managing various successful departments.<br \/>\n<br \/>\nMy performance is recognized as high energy, detail oriented and professional. I am highly regarded for my dedication and loyalty to my employer, their workers, customers and suppliers and, above all, the owners and executives to whom I provide support. <br \/>\n<br \/>\nAt the Canadian Cancer Society, PEI Division, as Executive Assistant, I provided ongoing support to the Executive Director and Board of Directors. A brief overview of my tasks included complex calendar scheduling, communication and planning of external meetings, travel arrangements and expense claims, detailed Board meeting preparation and recording of minutes and action items.  In addition to providing full support to the Executive Office, I was an active and valued member of the Senior Management Team. <br \/>\n<br \/>\nAs Office Manager, I ensured the smooth operation of the Society’s office space, including telephones, office supplies, furniture and lease agreements.  In all aspects of managing the office, I attempted to refine tasks so they were completed more efficiently and negotiated pricing to reduce associated costs to accommodate budget restrictions.  <br \/>\n<br \/>\nIn my previous position at Empire Marketing, while providing ongoing assistance to three executives, I successfully managed and supervised a staff of three in the Administration Department and smoothly and efficiently managed an office of over eighty staff members. In addition, I provided daily assistance to the Human Resources and Security Consultants where confidentiality and discretion were of utmost importance.  As a volunteer member of the Charity and Social Club Committees, I also enjoyed bringing people together for fun and fulfilling events.   <br \/>\n<br \/>\nI have been commended for my exceptional problem solving, organizational and time management skills, attention to detail, team spirit, and ability to multi task. I have been privy to highly confidential information and have proven to be a valuable and trusted member of the senior level team. An ability to develop strong and lasting business relationships is a solid reflection of my strong interpersonal and communication skills. Recognized as flexible and eager to learn, my past participation in new projects and new programs enabled me to become deeply involved with my employer’s goals and commitments.<br \/>\n","experience":[{"title":"Executive Assistant\/Office Manager","location":"Charlottetown, PE","company":"Canadian Cancer Society, PEI Division","start_month":"Mar","start_year":"2009","end_year":"2013","end_month":"Nov","description":"EXECUTIVE ASSISTANT <br \/>\nAssist the Executive Director with complex calendar scheduling, correspondence, daily planning, organizing tasks; Support Senior Management team; book travel arrangements; process expense claims; assist Board of Directors with various tasks, schedule committee meetings; plan and organize Board meetings, Annual General Meeting, teleconferences; prepare background material for Board meetings; participate in meetings and record minutes and action items; liaise with Board members,  all levels of staff, government offices, volunteers, clients and business colleagues; set up and maintain paper and electronic filing systems.<br \/>\n<br \/>\nOFFICE MANAGER <br \/>\nMonitor and approve purchases of office supplies to ensure expenses are kept within budget restrictions; negotiate leases for office equipment; research market value for office space and negotiate terms for lease.<br \/>\nCoordinate office move for a staff of ten; organize and eliminate excess office furniture; coordinate move requirements for system server, data, telephone, electric lines and electronic security system. <br \/>\n<br \/>\n","id":"2652"},{"title":"Data Research Clerk","location":"Charlottetown, PE","company":"Veterans Affairs Canada","start_month":"Oct","start_year":"2008","end_year":"2009","end_month":"Feb","description":"DATA RESEARCH - STATISTICS, FINANCE DEPARTMENT -  3-MONTH CASUAL POSITION <br \/>\nResearch electronic (CSDN) and paper files to determine effective dates for disability pensions. Update database; communicate with internal and external contacts using GroupWise, WordPerfect. <br \/>\n","id":"2653"},{"title":"EXECUTIVE ASSISTANT & OFFICE ADMINISTRATOR  ","location":"Richmond, BC","company":"Empire Marketing Corp.","start_month":"Mar","start_year":"1998","end_year":"2007","end_month":"Dec","description":"EXECUTIVE ASSISTANT<br \/>\nAssisted three executives on a daily basis: planned and scheduled complex meetings and appointments using Outlook calendars and reminders; drafted, edited and proofed senior level correspondence; participated in and recorded minutes for several senior level meetings; acted as main contact for senior business associates; liaised with suppliers, lawyers and associates; coordinated and negotiated major office renovations with contractors and office designers; negotiated leases; arranged various staff functions, such as weekend trips and Christmas parties; acted as liaison between all staff levels and the executive team; coordinated travel plans and booked appropriate arrangements; prepared expense accounts;  organized paper and electronic files for senior level executives; planned, coordinated and participated in programs created for marketing campaigns; maintained a high level of confidentiality while working with personnel, security files and executive information, set up and maintain paper and electronic filing systems.<br \/>\n<br \/>\nOFFICE ADMINISTRATOR<br \/>\nSupervised Administration department staff; monitored and approved purchases of office supplies and furniture; negotiated and purchased or leased office equipment; ensured deadlines were met and priorities were established. <br \/>\nOther duties included assisting the Human Resources Consultant and the Security and Compliance Consultant: liaised and negotiated fees with personnel agencies regarding staff hires; negotiated and administered benefits for all staff; proofed and edited correspondence and policy drafts; created and maintained all staff personnel files; created and maintained all security files and arranged for the appropriate security requirements.<br \/>\n<br \/>\n<br \/>\nAccomplishments:<br \/>\n• Streamlined the scheduling process for meetings by implementing the use of Outlook to record and monitor the availability of people and resources, such as boardrooms and projectors. <br \/>\n• Reduced the cost of employee recruiting by negotiating fees with agencies and using the skills of local Service Bureaus for qualified candidates.<br \/>\n• Volunteer member of a very successful Charity Committee and Social Club Committee. <br \/>\n<br \/>\n<br \/>\n<br \/>\nDATA ENTRY\/FULFILLMENT MANAGER 1998 – 2000<br \/>\nManaged the data entry department; order entry; account updates; daily deposits; processing and mailing of fulfillments; report preparation; organizing the workload to ensure timely and accurate processing of customer orders. <br \/>\n<br \/>\n<br \/>\nAccomplishments:<br \/>\n• Enabled company to produce their own reports in a timelier manner than offsite processing. <br \/>\n• Implemented operational structure of in-house data entry and order processing departments, tailored to the needs of the Direct Marketing industry. <br \/>\n<br \/>\n","id":"2654"},{"title":"OPERATIONS MANAGER ","location":"Montreal, QC","company":"CANADIAN CAPITAL FINANCIAL MARKETS,","start_month":"Aug","start_year":"1992","end_year":"1995","end_month":"Jul","description":"Managed the data input and cash processing department of a new factoring company: cash application and deposit processing; computer systems; purchasing of accounts; report distribution and communication with clients; liaised with computer system support staff\/programmers regarding general operations, procedures and updates to programs; <br \/>\nAccomplishments:<br \/>\n• Implemented a complete operational structure from the ground up, for a new company.<br \/>\n• Project managed the implementation of custom software tailored to the needs of the factoring industry.<br \/>\n","id":"2655"},{"title":"Manager\/Supervisor","location":"Montreal, QC","company":"Bank of Boston Canada","start_month":"May","start_year":"1981","end_year":"1992","end_month":"May","description":"MANAGER, CURRENT ACCOUNTS 1988-1992<br \/>\nManaged four staff members in the Current Accounts department; monitor the computerized processing of financial transactions; maintain computerized telephone system and security; corporate policy development\/implementation; and employee recruitment and performance \/compensation review; aided clients with reconciliations of bank statements.<br \/>\n<br \/>\n<br \/>\nAccomplishments:<br \/>\n• Motivated staff to overcome their reluctance to learn new computer technology.<br \/>\n• Established a cross-training program eliminating overtime costs and providing critical back up for systems operations.<br \/>\n<br \/>\nSUPERVISOR, CREDIT SUPPORT & LEGAL DEPARTMENT  1981-1988<br \/>\nManaged nine staff: process credit requests: monitor support personnel in credit functions; managed and oversaw the conversion of paper record filing system to reflect newly acquired program account numbers;  ensured filing records were kept up to date and in excellent order; reviewed delinquent accounts and made final effort to collect; if unsuccessful, placed with the legal department for lawyer collection; coordinated computer system changes with programmer analysts; prepared department budget; employee recruitment and  performance\/compensation reviews.<br \/>\n<br \/>\n<br \/>\nAccomplishments:<br \/>\n• Coordinated the conversion of the new computerized credit system.<br \/>\n• Revised department procedures and workload, which eliminated unnecessary transactions and positions. <br \/>\n• Provided effective staff support during a period of major transition. <br \/>\n","id":"2656"}],"education":[{"level":"High School","level_id":"1","field":"","school":"James Lyng","school_id":"230","country":"0","location":"Montreal, QC","graduation_year":"1984","start_year":"1984","description":"","id":"1018"}],"education_level":{"1":"High School","2":"College Degree","3":"Bachelor Degree","4":"Masters Degree","5":"Doctoral Degree","8":"Online Course","6":"Other (Please Specify)"},"field_study":{"1":"Agriculture","6":"Arts","11":"Business","14":"Construction","2":"Education","3":"Engineering","4":"General","5":"Health and welfare","12":"Law","13":"Manufacturing","7":"Other","8":"Science","9":"Services","10":"Social sciences"},"other":"Although I currently live in Prince Edward Island, I have plans to relocate when the right opportunity presents itself and I would welcome the opportunity to meet with you to discuss how my qualifications, dedication and experience would prove to be a valuable, long-term asset to Imperial Manufacturing Group.","skill":[{"id":"4228","skill_id":"22738","title":"Monitor","expertise":"3"},{"id":"4227","skill_id":"8955","title":"Data Entry","expertise":"2"},{"id":"4226","skill_id":"25673","title":"Paper","expertise":"3"},{"id":"4225","skill_id":"27913","title":"Processing","expertise":"3"},{"id":"4224","skill_id":"13341","title":"Filing","expertise":"3"},{"id":"4223","skill_id":"12520","title":"Executive Calendar Management","expertise":"3"},{"id":"4222","skill_id":"12513","title":"Executive Administrative","expertise":"3"},{"id":"4221","skill_id":"31435","title":"Security","expertise":"2"},{"id":"4220","skill_id":"22408","title":"Minutes","expertise":"3"},{"id":"4219","skill_id":"29932","title":"Research","expertise":"2"},{"id":"4218","skill_id":"1988","title":"Arrangements","expertise":"3"},{"id":"4217","skill_id":"36324","title":"Travel Arrangements","expertise":"3"},{"id":"4216","skill_id":"21321","title":"Marketing","expertise":"2"},{"id":"4215","skill_id":"3585","title":"Board of Directors","expertise":"3"},{"id":"4214","skill_id":"7714","title":"Coordinate","expertise":"3"},{"id":"4213","skill_id":"21858","title":"Meeting","expertise":"3"},{"id":"4212","skill_id":"31142","title":"scheduling","expertise":"3"},{"id":"4211","skill_id":"36322","title":"Travel","expertise":"3"},{"id":"4210","skill_id":"6791","title":"Communication","expertise":"3"},{"id":"4209","skill_id":"26822","title":"Planning","expertise":"3"},{"id":"4208","skill_id":"21060","title":"Management","expertise":"3"},{"id":"4207","skill_id":"34355","title":"Support","expertise":"3"}],"progress":100}